app/controllers/admin_controller.rb

  def load_insights_data
    @page_views = AnalyticsEvent.page_views.in_date_range(@start_date, @end_date).count
    @unique_visitors = AnalyticsEvent.unique_visitors(@start_date, @end_date)
    @start_clicks = AnalyticsEvent.start_clicks.in_date_range(@start_date, @end_date).distinct.count(:session_id)
---
SELECT COUNT(DISTINCT "analytics_events"."session_id") FROM "analytics_events" WHERE "analytics_events"."created_at" BETWEEN '2025-12-12 00:00:00' AND '2025-12-12 23:59:59.999999'