app/controllers/analytics_controller.rb

  def track
    session_id = session.id.to_s

    AnalyticsEvent.create!(
      session_id: session_id,
      event_type: params[:event_type],
      event_data: params[:event_data] || {},
      ip_address: request.remote_ip,
      user_agent: request.user_agent
    )
---
INSERT INTO "analytics_events" ("session_id", "event_type", "event_data", "ip_address", "user_agent", "created_at", "updated_at") VALUES ('f17743f54ef283f8d70df6946bb6cc1c', 'page_view', '{}', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36', '2025-12-12 11:58:29.966866', '2025-12-12 11:58:29.966866') RETURNING "id"