app/models/analytics_event.rb

SELECT COUNT(DISTINCT "analytics_events"."session_id") FROM "analytics_events" WHERE "analytics_events"."created_at" BETWEEN '2025-12-12 00:00:00' AND '2025-12-12 23:59:59.999999'
---
  def self.unique_visitors(start_date, end_date)
    in_date_range(start_date, end_date).distinct.count(:session_id)

SELECT "analytics_events".* FROM "analytics_events" WHERE "analytics_events"."session_id" = '7138523d-952c-4151-957e-cb48f143b6f2' AND "analytics_events"."event_type" = 'question_answer' AND (json_extract(event_data, '$.question') = 3) ORDER BY "analytics_events"."id" ASC LIMIT 1
---
  def self.get_completed_responses(start_date, end_date)
    completed_sessions = in_date_range(start_date, end_date)
      .result_views
      .pluck(:session_id, :created_at)
      .to_h

    responses = []

    completed_sessions.each do |session_id, completed_at|
      answers = {}

      (3..10).each do |q|
        event = where(session_id: session_id, event_type: 'question_answer')
          .where("json_extract(event_data, '$.question') = ?", q)
          .first